newbie-jiang/amb82-mini-RTL8735B/sdk-ameba-v9.6c/sdk-ameba-v9.6c/component/media/mmfv2/module_vipnn.c
/******************************************************************************
*
* Copyright(c) 2007 - 2018 Realtek Corporation. All rights reserved.
*
******************************************************************************/

#include <stdint.h>
#include <stdlib.h>
#include "rtl8735b.h"
#include <hal_cache.h>
#include <hal_sys_ctrl.h>
#include "mmf2_module.h"
#include "osdep_service.h"
#include "module_vipnn.h"
#include "avcodec.h"
#include "device_lock.h"
#include "nn_file_op.h"

#include "nn_utils/tensor.h"
#include "nn_api.h"

// TODO move to vipnn context
#define DBG_LEVEL	LOG_MSG

#define LOG_OFF		4
#define LOG_ERR		3
#define LOG_MSG		2
#define LOG_INF		1
#define LOG_ALL		0
#define LOG_DBG		-1

#define dprintf(level, ...) if((level >= DBG_LEVEL) || (level==LOG_DBG && level==DBG_LEVEL)) do{printf(__VA_ARGS__);}while(0)

static int vipnn_inited = 0;
static int vipnn_module_cnt = 0;

#define TICK_INIT()
#define TICK_GET() (uint32_t)mm_read_mediatime_ms()

#define NN_MEASURE_INIT(n)	do{ctx->measure.tick[n] = 0; TICK_INIT();}while(0)
#define NN_MEASURE_START(n) do{ctx->measure.tick[n] = TICK_GET();}while(0)
#define NN_MEASURE_STOP(n)  do{ctx->measure.tick[n] = TICK_GET() - ctx->measure.tick[n];}while(0)
#if DBG_LEVEL <= LOG_MSG
#define NN_MEASURE_PRINT(n) do{printf("%s tick[%d] = %d\n\r", ctx->params.model->name, n, ctx->measure.tick[n]);}while(0)
#else
#define NN_MEASURE_PRINT(n) do{}while(0)
#endif

#define ONERROR(status, string, exit_anchor)    \
    do {                                        \
        if (status != VIP_SUCCESS) {            \
            printf("error: %s\n", string);      \
            goto exit_anchor;                   \
        }                                       \
    } while (0)

#define CHK(condition, exit_anchor) \
    do {                            \
        if (!(condition)) {         \
            goto exit_anchor;       \
        }                           \
    } while (0)

#define CHK_MSG(condition, exit_anchor, errorMessage, ...)  \
    do {                                                    \
        if (!(condition)) {                                 \
            printf(errorMessage, ##__VA_ARGS__);            \
            goto exit_anchor;                               \
        }                                                   \
    } while (0)

int vipnn_deoply_network(void *p);
void *vipnn_new_item(void *p);
void *vipnn_del_item(void *p, void *d);
int vipnn_create_buffer_from_input(void *p, void *input);
void *vipnn_allocate_videomemory(size_t size);
void vipnn_free_videomemory(void *ptr);

/*
void vipnn_mark(char *model_name, int num)
{
	mm_printf("vnn %s %d\n\r",model_name, num);
}
*/

//#define vipnn_mark() mm_printf("vnn %s %d\n\r",ctx->params.model->name, __LINE__);
#define vipnn_mark()

static int vipnn_handle(void *p, void *input, void *output)
{
	vipnn_ctx_t *ctx = (vipnn_ctx_t *)p;
	mm_queue_item_t *input_item = (mm_queue_item_t *)input;
	mm_queue_item_t *output_item = (mm_queue_item_t *)output;

	vip_status_e status = VIP_SUCCESS;
	int vip_input_created = 0;

	// check the model has been applied before inference
	CHK_MSG(ctx->status == VIPNN_APPLIED, clean_up, "error: vipnn not applied\r\n");

	int post_res_cnt = 0;
	void *out_tensor[6];

	dprintf(LOG_INF, "in %p out %p\n\r", input, output);
	dprintf(LOG_INF, "run %s model\n\r", ctx->params.model->name);

	if (ctx->measure.time0 == 0) {
		ctx->measure.time0 = (int)mm_read_mediatime_ms();
	}

	vipnn_mark();

	vipnn_out_buf_t *last_model_output = (vipnn_out_buf_t *)input_item->data_addr;
	void *input_data = (void *)input_item->data_addr;
	int input_size = input_item->size;
	nn_data_param_t *input_param = ctx->params.in_param;
	int loop_cnt = 1;

	// check model input type match to source type
	if (input_param != NULL) {
		CHK_MSG(input_param->codec_type == input_item->type, clean_up, "%s error: model input type[%d] not match to source type[%d]\n\r", ctx->params.model->name,
				input_param->codec_type, input_item->type);
	}
	if (ctx->cas_mode != 0) {
		dprintf(LOG_INF, "cascade mode\n\r");
		dprintf(LOG_INF, "cascade: input = %x\n\r", last_model_output);
		dprintf(LOG_INF, "cascade: obj = %d\n\r", last_model_output->res_cnt);
	}

	// cascade mode and last model object number = 0, stop inference
	if (ctx->cas_mode != 0) {
		CHK(last_model_output->res_cnt != 0, clean_up);
	}

	if (ctx->cas_mode == 2) {
		loop_cnt = last_model_output->res_cnt;
	}

	dprintf(LOG_INF, "loop cnt = %d\n\r", loop_cnt);

	if (loop_cnt > MAX_OUT_BUFFER_CNT) {
		loop_cnt = MAX_OUT_BUFFER_CNT;
		dprintf(LOG_INF, "set loop cnt to %d\n\r", MAX_OUT_BUFFER_CNT);
	}

	vipnn_out_buf_t *out = NULL;//(vipnn_out_buf_t *)(output_item->data_addr);

	if (output_item == NULL || output_item->data_addr == 0) {
		dprintf(LOG_INF, "[vipnn] use tmp buffer\n\r");
		out = ctx->tmp_item;
	} else {
		out = (vipnn_out_buf_t *)(output_item->data_addr);
	}

	out->res_cnt = 0;

	for (int i = 0; i < loop_cnt; i++) {
		// update input_param and input_data ==> input image and roi here

		nn_data_param_t cas_input_param;
		if (ctx->cas_mode != 0) {
			cas_input_param.codec_type = last_model_output->input_param->codec_type;
			cas_input_param.img.width = last_model_output->input_param->img.width;
			cas_input_param.img.height = last_model_output->input_param->img.height;
			cas_input_param.img.rgb = 0;

			if (ctx->params.model->cas_in_setup) {
				ctx->params.model->cas_in_setup(&last_model_output->res[0], i, &cas_input_param);
			} else {
				cas_input_param.img.roi.xmin = 0;
				cas_input_param.img.roi.ymin = 0;
				cas_input_param.img.roi.xmax = cas_input_param.img.width;
				cas_input_param.img.roi.ymax = cas_input_param.img.height;
			}

			input_data = last_model_output->input_data;
			input_param = &cas_input_param;
		} else {
			input_param->priv = (void *)input_data;
		}

		dprintf(LOG_INF, "input %x w %d h %d\n\r", input_data, input_param->img.width, input_param->img.height);

		int pre_ret = PP_USE_INPUT;
		if (ctx->params.model->preprocess) {
			if (ctx->params.in_param) {
				ctx->params.in_param->size_in_byte = input_size;
			}
			pre_ret = ctx->params.model->preprocess(input_data, input_param, (void *)ctx->pre_tensor, &ctx->params.model->input_param);
		}

		switch (pre_ret) {
		case PP_ERROR:
			CHK_MSG(false, clean_up, "%s pre-process fail\n\r", ctx->params.model->name);
			break;
		case PP_SKIP_INF:
			CHK(false, clean_up);
			break;
		case PP_USE_RESULT:
			for (int i = 0; i < ctx->input_count; i++) {
				device_mutex_lock(RT_DEV_LOCK_NN);
				status = vip_create_buffer_from_handle(&ctx->vip_param_in[i], (void *)ctx->pre_tensor[i], ctx->pre_tensor_size[i], &ctx->input_buffers[i]);
				device_mutex_unlock(RT_DEV_LOCK_NN);
				ONERROR(status, "error: vip_create_buffer_from_handle fail.", clean_up);
			}
			vip_input_created = 1;
			break;
		case PP_USE_INPUT:
			CHK_MSG(vipnn_create_buffer_from_input(ctx, input_item) == 0, clean_up, "error: vipnn_create_buffer_from_input fail\n\r");
			vip_input_created = 1;
			break;
		}

