newbie-jiang/amb82-mini-RTL8735B/sdk-ameba-v9.6c/sdk-ameba-v9.6c/component/media/mmfv2/module_vipnn.c
		// set input here, output has been set in vipnn_deoply_network()
		for (int i = 0; i < ctx->input_count; i++) {
			device_mutex_lock(RT_DEV_LOCK_NN);
			status = vip_set_input(ctx->network, i, ctx->input_buffers[i]);
			device_mutex_unlock(RT_DEV_LOCK_NN);
			ONERROR(status, "error: vip_set_input fail.", clean_up);
		}

		vipnn_mark();

		// run network
		device_mutex_lock(RT_DEV_LOCK_NN);
		status = vip_run_network(ctx->network);
		device_mutex_unlock(RT_DEV_LOCK_NN);
		ONERROR(status, "error: vip_run_network fail.", clean_up);

		// query inference time and cycle
		vip_inference_profile_t inf_info;
		device_mutex_lock(RT_DEV_LOCK_NN);
		vip_query_network(ctx->network, VIP_NETWORK_PROP_PROFILING, &inf_info);
		device_mutex_unlock(RT_DEV_LOCK_NN);
		dprintf(LOG_MSG, "%s tick[%ld]\n\r", ctx->params.model->name, inf_info.inference_time);
		dprintf(LOG_INF, "cycle[%ld]\n\r", inf_info.total_cycle);

		// always destroy vip input buffer after inference
		if (vip_input_created) {
			for (int i = 0; i < ctx->input_count; i++) {
				device_mutex_lock(RT_DEV_LOCK_NN);
				status = vip_destroy_buffer(ctx->input_buffers[i]);
				device_mutex_unlock(RT_DEV_LOCK_NN);
				ONERROR(status, "error: vip_destroy_buffer fail.", clean_up);
			}
			vip_input_created = 0;
		}

		vipnn_mark();
		for (int i = 0; i < ctx->output_count; i++) {
			device_mutex_lock(RT_DEV_LOCK_NN);
			status = vip_flush_buffer(ctx->output_buffers[i], VIP_BUFFER_OPER_TYPE_INVALIDATE);
			device_mutex_unlock(RT_DEV_LOCK_NN);
			ONERROR(status, "error: vip_flush_buffer fail.", clean_up);
		}

		vipnn_mark();
		// get output and do postprocessing
		for (int i = 0; i < ctx->output_count; i++) {
			device_mutex_lock(RT_DEV_LOCK_NN);
			out_tensor[i] = (void *)vip_map_buffer(ctx->output_buffers[i]);
			device_mutex_unlock(RT_DEV_LOCK_NN);
		}

		vipnn_mark();

		if (ctx->params.model->postprocess) {
			dprintf(LOG_INF, "out %p, res %p\n\r", out, &out->res[0]);

			// cascade mode: pass last model result to post-processing
			if (ctx->cas_mode != 0) {
				ctx->params.model->output_param.priv = (void *)(((uint8_t *)&last_model_output->res[0]) + i * last_model_output->res_size);
			} else {
				ctx->params.model->output_param.priv = NULL;
			}

			dprintf(LOG_INF, "out %p, res %p\n\r", &out->res[0], (void *)((uint8_t *)&out->res[0] + out->res_cnt * ctx->params.out_res_size));
			post_res_cnt = ctx->params.model->postprocess(out_tensor, &ctx->params.model->output_param,
						   (void *)((uint8_t *)&out->res[0] + out->res_cnt * ctx->params.out_res_size));

			out->res_cnt += post_res_cnt;
		}

		vipnn_mark();

		if (ctx->module_out_en) {
			out->input_data = input_data;
			if (ctx->cas_mode != 0) {
				out->input_param = last_model_output->input_param;
			} else {
				out->input_param = input_param;
			}
		}

		if (ctx->module_out_en && ctx->params.save_out_tensor) {
			out->tensors.vipnn_out_tensor_num = ctx->output_count;
			for (int i = 0; i < ctx->output_count; i++) {
				out->tensors.vipnn_out_tensor[i] = out_tensor[i];
				switch (ctx->vip_param_out[i].quant_format) {
				case VIP_BUFFER_QUANTIZE_DYNAMIC_FIXED_POINT:
					out->tensors.quant_format[i] = VIP_BUFFER_QUANTIZE_DYNAMIC_FIXED_POINT;
					out->tensors.quant_data[i].dfp.fixed_point_pos = ctx->vip_param_out[i].quant_data.dfp.fixed_point_pos;
					out->tensors.vipnn_out_tensor_size[i] = sizeof(int16_t);
					break;
				case VIP_BUFFER_QUANTIZE_TF_ASYMM:
					out->tensors.quant_format[i] = VIP_BUFFER_QUANTIZE_TF_ASYMM;
					out->tensors.quant_data[i].affine.scale = ctx->vip_param_out[i].quant_data.affine.scale;
					out->tensors.quant_data[i].affine.zeroPoint = ctx->vip_param_out[i].quant_data.affine.zeroPoint;
					out->tensors.vipnn_out_tensor_size[i] = sizeof(uint8_t);
					break;
				default:
					//printf(", none-quant\n\r");
					out->tensors.vipnn_out_tensor_size[i] = sizeof(__fp16);
				}
				for (int k = 0; k < ctx->params.model->output_param.dim[i].num; k++) {
					out->tensors.vipnn_out_tensor_size[i] = out->tensors.vipnn_out_tensor_size[i] * ctx->params.model->output_param.dim[i].size[k];
				}
			}
		}
	}

	vipnn_mark();

	if (ctx->disp_postproc) {
		ctx->disp_postproc(out, input_param);
	}

	vipnn_mark();

	ctx->measure.count++;
	if (ctx->measure.count % 16 == 0) {
		float nn_fps = (float)ctx->measure.count * 1000.0 / (float)(xTaskGetTickCount() - ctx->measure.time0);
		dprintf(LOG_MSG, ">>> %s FPS = %0.2f\n\r", ctx->params.model->name, nn_fps);
		dprintf(LOG_INF, ">>> %s count %d tick %d\n\r", ctx->params.model->name, nn_fps, ctx->measure.count, xTaskGetTickCount() - ctx->measure.time0);
	}
	vipnn_mark();

	/*------------------------------------------------------*/
	if (ctx->module_out_en && (out->res_cnt > 0 || ctx->params.save_out_tensor)) {
		output_item->size = sizeof(vipnn_out_buf_t) + ctx->params.out_res_size * ctx->params.out_res_max_cnt;
		//memcpy(output_item->data_addr, &tensor_out_next, output_item->size);
		output_item->timestamp = input_item->timestamp;
		output_item->type = AV_CODEC_ID_NN_RAW;
		memcpy(output_item->name, input_item->name, sizeof(output_item->name));

		return output_item->size;
	}

	vipnn_mark();

clean_up:
	if (vip_input_created) {
		for (int i = 0; i < ctx->input_count; i++) {
			device_mutex_lock(RT_DEV_LOCK_NN);
			status = vip_destroy_buffer(ctx->input_buffers[i]);
			device_mutex_unlock(RT_DEV_LOCK_NN);
			if (status != VIP_SUCCESS) {
				dprintf(LOG_ERR, "error: vip_destroy_buffer fail.\n\r");
			}
		}
	}

	return 0;
}

int vipnn_control(void *p, int cmd, int arg)
{
	int ret = 0;
	vipnn_ctx_t *ctx = (vipnn_ctx_t *)p;

	switch (cmd) {
	case CMD_VIPNN_SET_MODEL:
		ctx->params.model = (nnmodel_t *)arg;
		break;
	case CMD_VIPNN_SET_IN_PARAMS:
		ctx->params.in_param = (nn_data_param_t *)arg;
		if (!ctx->params.in_param->codec_type) {
			ctx->params.in_param->codec_type = AV_CODEC_ID_UNKNOWN;
		}
		break;
	case CMD_VIPNN_SET_DISPPOST:
		ctx->disp_postproc = (disp_postprcess_t)arg;
		break;
	case CMD_VIPNN_GET_STATUS:
		*(vipnn_status_t *)arg = ctx->status;
		break;
	case CMD_VIPNN_SET_CONFIDENCE_THRES:
		if (ctx->params.model->set_confidence_thresh) {
			ctx->params.model->set_confidence_thresh((void *)arg);
		}
		break;
	case CMD_VIPNN_SET_NMS_THRES:
		if (ctx->params.model->set_nms_thresh) {
			ctx->params.model->set_nms_thresh((void *)arg);
		}
		break;
	case CMD_VIPNN_SET_OUTPUT:
		ctx->module_out_en = (bool)arg;
		((mm_context_t *)ctx->parent)->module->output_type = MM_TYPE_VSINK;
		break;
	case CMD_VIPNN_SET_OUTPUT_TYPE:
		ctx->module_out_type = (vipnn_out_type_t)arg;
		break;
	case CMD_VIPNN_SET_CASCADE:
		ctx->cas_mode = arg;
		break;
	case CMD_VIPNN_SET_RES_SIZE:
		ctx->params.out_res_size = arg;
		break;
	case CMD_VIPNN_SET_RES_MAX_CNT:
		ctx->params.out_res_max_cnt = arg;
		break;
	case CMD_VIPN_SET_SAVE_OUT_TENSOR:
		ctx->params.save_out_tensor = arg;
		break;
	case CMD_VIPNN_SET_USR_OUTPUT_BUF:
		ctx->params.usr_output = (usr_output_tensor_t *)arg;
		break;
	case CMD_VIPNN_APPLY:
		ctx->tmp_item = vipnn_new_item(ctx);
		if (!ctx->tmp_item) {
			dprintf(LOG_ERR, "%s out of resource %d\n\r", ctx->params.model->name, __LINE__);
			ret = -1;
			break;
		}
		dprintf(LOG_MSG, "Deploy %s\n\r", ctx->params.model->name);
		device_mutex_lock(RT_DEV_LOCK_NN);
		ret = vipnn_deoply_network(ctx);
		device_mutex_unlock(RT_DEV_LOCK_NN);
		if (ret == 0) {
			ctx->status = VIPNN_APPLIED;
		}
		break;
	}

	return ret;
}

int vipnn_create_buffer_from_input(void *p, void *input)
{
	vipnn_ctx_t *ctx = (vipnn_ctx_t *)p;
	mm_queue_item_t *input_item = (mm_queue_item_t *)input;
	void *input_data = (void *)input_item->data_addr;
	int input_size = input_item->size;

