newbie-jiang/amb82-mini-RTL8735B/sdk-ameba-v9.6c/sdk-ameba-v9.6c/component/media/mmfv2/module_vipnn.c
	vip_status_e status = VIP_SUCCESS;

	if (input_item->type == AV_CODEC_ID_RGB888 && ctx->params.model->input_param.count == 1) {
		device_mutex_lock(RT_DEV_LOCK_NN);
		status = vip_create_buffer_from_handle(&ctx->vip_param_in[0], input_data, input_size, &ctx->input_buffers[0]);
		device_mutex_unlock(RT_DEV_LOCK_NN);
		ONERROR(status, "error: vip_create_buffer_from_handle fail.", error);
	} else if (input_item->type == AV_CODEC_ID_NV12 && ctx->params.model->input_param.count == 2) {
		uint8_t *y_addr = (uint8_t *)input_data;
		uint32_t y_data_len = input_size * 2 / 3;
		device_mutex_lock(RT_DEV_LOCK_NN);
		status = vip_create_buffer_from_handle(&ctx->vip_param_in[0], (void *)y_addr, y_data_len, &ctx->input_buffers[0]);
		device_mutex_unlock(RT_DEV_LOCK_NN);
		ONERROR(status, "error: vip_create_buffer_from_handle fail.", error);
		device_mutex_lock(RT_DEV_LOCK_NN);
		status = vip_create_buffer_from_handle(&ctx->vip_param_in[1], (void *)(y_addr + y_data_len), input_size - y_data_len, &ctx->input_buffers[1]);
		device_mutex_unlock(RT_DEV_LOCK_NN);
		ONERROR(status, "error: vip_create_buffer_from_handle fail.", error);
	} else {
		for (int i = 0; i < ctx->input_count; i++) {
			device_mutex_lock(RT_DEV_LOCK_NN);
			status = vip_create_buffer_from_handle(&ctx->vip_param_in[i], input_data, input_size, &ctx->input_buffers[i]);
			device_mutex_unlock(RT_DEV_LOCK_NN);
			ONERROR(status, "error: vip_create_buffer_from_handle fail.", error);
		}
	}
	return 0;

error:
	return -1;
}

void vipnn_deinited(void *p)
{
	vipnn_ctx_t *ctx = (vipnn_ctx_t *)p;

	vip_finish_network(ctx->network);

	vip_destroy_network(ctx->network);

	// destroy vip output buffer here, vip intput buffer has been destroyed after inference
	for (int i = 0; i < ctx->output_count; i++) {
		vip_unmap_buffer(ctx->output_buffers[i]);
		vip_destroy_buffer(ctx->output_buffers[i]);
	}

	for (int i = 0; i < ctx->input_count; i++) {
		if (ctx->pre_tensor[i]) {
			vipnn_free_videomemory(ctx->pre_tensor[i]);
			ctx->pre_tensor[i] = NULL;
		}
	}

	if (ctx->params.model->release) {
		ctx->params.model->release();
	}

	if (ctx->params.model->model_content) {
		vipnn_free_videomemory(ctx->params.model->model_content);
		ctx->params.model->model_content = NULL;
	}

	ctx->status = VIPNN_DEINITED;
}

void *vipnn_destroy(void *p)
{
	vipnn_ctx_t *ctx = (vipnn_ctx_t *)p;

	if (ctx) {
		if (ctx->status != VIPNN_DEINITED) {
			device_mutex_lock(RT_DEV_LOCK_NN);
			vipnn_deinited(ctx);
			device_mutex_unlock(RT_DEV_LOCK_NN);
		}

		if (ctx->tmp_item) {
			vipnn_del_item(ctx, ctx->tmp_item);
		}

		free(ctx);

		vipnn_module_cnt--;
		if (vipnn_module_cnt == 0 && vipnn_inited == 1) {
			printf("vip_destroy done\r\n");
			vipnn_inited = 0;
		}
	}
	return NULL;
}

void vipnn_dump_network_io_params(void *p)
{
	vipnn_ctx_t *ctx = (vipnn_ctx_t *)p;

	printf("---------------------------------\n\r");
	printf("input count %d, output count %d\n\r", ctx->input_count, ctx->output_count);
	for (int i = 0; i < ctx->input_count; i++) {
		printf("input param %d\n\r", i);
		printf("\tdata_format  %x\n\r", ctx->vip_param_in[i].data_format);
		printf("\tmemory_type  %x\n\r", ctx->vip_param_in[i].memory_type);
		printf("\tnum_of_dims  %x\n\r", ctx->vip_param_in[i].num_of_dims);
		//printf("\tquant_data   %x\n\r", ctx->vip_param_in[i].quant_data);
		printf("\tquant_format %x\n\r", ctx->vip_param_in[i].quant_format);
		printf("\tquant_data  ");
		switch (ctx->vip_param_in[i].quant_format) {
		case VIP_BUFFER_QUANTIZE_DYNAMIC_FIXED_POINT:
			printf(", dfp=%d\n\r", ctx->vip_param_in[i].quant_data.dfp.fixed_point_pos);
			break;
		case VIP_BUFFER_QUANTIZE_TF_ASYMM:
			printf(", scale=%f, zero_point=%d\n\r", ctx->vip_param_in[i].quant_data.affine.scale,
				   ctx->vip_param_in[i].quant_data.affine.zeroPoint);
			break;
		default:
			printf(", none-quant\n\r");
		}
		//printf("\tsizes        %x\n\r", ctx->vip_param_in[i].sizes);
		printf("\tsizes        ");
		for (int x = 0; x < 6; x++) {
			printf("%ld ", ctx->vip_param_in[i].sizes[x]);
		}
		printf("\n\r");
	}
	for (int i = 0; i < ctx->output_count; i++) {
		printf("output param %d\n\r", i);
		printf("\tdata_format  %x\n\r", ctx->vip_param_out[i].data_format);
		printf("\tmemory_type  %x\n\r", ctx->vip_param_out[i].memory_type);
		printf("\tnum_of_dims  %x\n\r", ctx->vip_param_out[i].num_of_dims);
		//printf("\tquant_data   %x\n\r", ctx->vip_param_out[i].quant_data);
		printf("\tquant_format %x\n\r", ctx->vip_param_out[i].quant_format);
		printf("\tquant_data  ");
		switch (ctx->vip_param_out[i].quant_format) {
		case VIP_BUFFER_QUANTIZE_DYNAMIC_FIXED_POINT:
			printf(", dfp=%d\n\r", ctx->vip_param_out[i].quant_data.dfp.fixed_point_pos);
			break;
		case VIP_BUFFER_QUANTIZE_TF_ASYMM:
			printf(", scale=%f, zero_point=%d\n\r", ctx->vip_param_out[i].quant_data.affine.scale,
				   ctx->vip_param_out[i].quant_data.affine.zeroPoint);
			break;
		default:
			printf(", none-quant\n\r");
		}
		//printf("\tsizes        %x\n\r", ctx->vip_param_out[i].sizes);
		printf("\tsizes        ");
		for (int x = 0; x < 6; x++) {
			printf("%ld ", ctx->vip_param_out[i].sizes[x]);
		}
		printf("\n\r");
	}
	printf("---------------------------------\n\r");
}

static vip_int32_t init_io_buffers(void *p)
{
	vipnn_ctx_t *ctx = (vipnn_ctx_t *)p;
	vip_network network = ctx->network;
	vip_status_e status = VIP_SUCCESS;

	int i = 0;

	vip_query_network(network, VIP_NETWORK_PROP_INPUT_COUNT, &ctx->input_count);
	if (ctx->input_count > MAX_IO_NUM) {
		dprintf(LOG_ERR, "error, input count is more than max value=%d\n\r", MAX_IO_NUM);
		return -1;
	}

	vip_query_network(network, VIP_NETWORK_PROP_OUTPUT_COUNT, &ctx->output_count);
	if (ctx->output_count > MAX_IO_NUM) {
		dprintf(LOG_ERR, "error, output count is more than max value=%d\n\r", MAX_IO_NUM);
		return -1;
	}

	for (i = 0; i < ctx->input_count; i++) {
		vip_buffer_create_params_t *param = &ctx->vip_param_in[i];
		memset(param, 0, sizeof(vip_buffer_create_params_t));
		param->memory_type = VIP_BUFFER_MEMORY_TYPE_DEFAULT;
		vip_query_input(network, i, VIP_BUFFER_PROP_DATA_FORMAT, &param->data_format);
		vip_query_input(network, i, VIP_BUFFER_PROP_NUM_OF_DIMENSION, &param->num_of_dims);
		vip_query_input(network, i, VIP_BUFFER_PROP_SIZES_OF_DIMENSION, param->sizes);
		vip_query_input(network, i, VIP_BUFFER_PROP_QUANT_FORMAT, &param->quant_format);
		switch (param->quant_format) {
		case VIP_BUFFER_QUANTIZE_DYNAMIC_FIXED_POINT:
			vip_query_input(network, i, VIP_BUFFER_PROP_FIXED_POINT_POS,
							&param->quant_data.dfp.fixed_point_pos);
			break;
		case VIP_BUFFER_QUANTIZE_TF_ASYMM:
			vip_query_input(network, i, VIP_BUFFER_PROP_TF_SCALE,
							&param->quant_data.affine.scale);
			vip_query_input(network, i, VIP_BUFFER_PROP_TF_ZERO_POINT,
							&param->quant_data.affine.zeroPoint);
		default:
			break;
		}

		dprintf(LOG_MSG, "input %d dim %d %d %d %d, data format=%d, quant_format=%d",
				i, param->sizes[0], param->sizes[1], param->sizes[2], param->sizes[3], param->data_format,
				param->quant_format);

