newbie-jiang/amb82-mini-RTL8735B/sdk-ameba-v9.6c/sdk-ameba-v9.6c/component/media/mmfv2/module_vipnn.c
		switch (param->quant_format) {
		case VIP_BUFFER_QUANTIZE_DYNAMIC_FIXED_POINT:
			dprintf(LOG_MSG, ", dfp=%d\n\r", param->quant_data.dfp.fixed_point_pos);
			break;
		case VIP_BUFFER_QUANTIZE_TF_ASYMM:
			dprintf(LOG_MSG, ", scale=%f, zero_point=%d\n\r", param->quant_data.affine.scale,
					param->quant_data.affine.zeroPoint);
			break;
		default:
			dprintf(LOG_MSG, ", none-quant\n\r");
		}
		// vip input buffer will be created from RGB/NV12 data buffer directly before inference, so the data copy can be saved

		//dprintf(LOG_MSG, "input buffer %d = %p, vid memory %x \n\r", i, ctx->input_buffers[i], ctx->input_buffers[i]->memory.physical);
	}

	for (i = 0; i < ctx->output_count; i++) {
		vip_buffer_create_params_t *param = &ctx->vip_param_out[i];
		memset(param, 0, sizeof(vip_buffer_create_params_t));
		param->memory_type = VIP_BUFFER_MEMORY_TYPE_DEFAULT;
		vip_query_output(network, i, VIP_BUFFER_PROP_DATA_FORMAT, &param->data_format);
		vip_query_output(network, i, VIP_BUFFER_PROP_NUM_OF_DIMENSION, &param->num_of_dims);
		vip_query_output(network, i, VIP_BUFFER_PROP_SIZES_OF_DIMENSION, param->sizes);
		vip_query_output(network, i, VIP_BUFFER_PROP_QUANT_FORMAT, &param->quant_format);
		switch (param->quant_format) {
		case VIP_BUFFER_QUANTIZE_DYNAMIC_FIXED_POINT:
			vip_query_output(network, i, VIP_BUFFER_PROP_FIXED_POINT_POS,
							 &param->quant_data.dfp.fixed_point_pos);
			break;
		case VIP_BUFFER_QUANTIZE_TF_ASYMM:
			vip_query_output(network, i, VIP_BUFFER_PROP_TF_SCALE,
							 &param->quant_data.affine.scale);
			vip_query_output(network, i, VIP_BUFFER_PROP_TF_ZERO_POINT,
							 &param->quant_data.affine.zeroPoint);
			break;
		default:
			break;
		}
		dprintf(LOG_MSG, "ouput %d dim %d %d %d %d, data format=%d",
				i, param->sizes[0], param->sizes[1], param->sizes[2], param->sizes[3], param->data_format);

		switch (param->quant_format) {
		case VIP_BUFFER_QUANTIZE_DYNAMIC_FIXED_POINT:
			dprintf(LOG_MSG, ", dfp=%d\n\r", param->quant_data.dfp.fixed_point_pos);
			break;
		case VIP_BUFFER_QUANTIZE_TF_ASYMM:
			dprintf(LOG_MSG, ", scale=%f, zero_point=%d\n\r", param->quant_data.affine.scale,
					param->quant_data.affine.zeroPoint);
			break;
		default:
			dprintf(LOG_MSG, ", none-quant\n\r");
		}

		if (ctx->params.usr_output) {
			status = vip_create_buffer_from_handle(param, ctx->params.usr_output->pbuf[i], ctx->params.usr_output->size[i], &ctx->output_buffers[i]);
		} else {
			status = vip_create_buffer(param, sizeof(vip_buffer_create_params_t), &ctx->output_buffers[i]);
		}
		ONERROR(status, "error: vip create buffer fail.", error);
		//dprintf(LOG_MSG, "output buffer %d = %p, vid memory %x \n\r", i, ctx->output_buffers[i], ctx->output_buffers[i]->memory.physical);
	}

	vipnn_dump_network_io_params(ctx);
	return 0;

error:
	return -1;
}

#define VIPNN_MEMORY_ALIGN_SIZE 4096

void *vipnn_allocate_videomemory(size_t size)
{
	extern vip_status_e gcvip_user_allocate_videomemory(vip_uint8_t **logical,
			void **handle, vip_uint32_t *physical, vip_uint32_t size,
			vip_uint32_t align,	vip_uint32_t alloc_flag);
	uint8_t *logical = VIP_NULL;
	unsigned int physical = 0;
	void *handle = VIP_NULL;
	vip_status_e status = VIP_SUCCESS;
	status = gcvip_user_allocate_videomemory(&logical, &handle, &physical,
			 size + VIPNN_MEMORY_ALIGN_SIZE, VIPNN_MEMORY_ALIGN_SIZE,
			 0x01);  //GCVIP_VIDEO_MEM_ALLOC_CONTIGUOUS
	ONERROR(status, "error: gcvip_user_allocate_videomemory fail.", error);
	*(uint32_t *)logical = (uint32_t)handle;
	return (void *)((uint8_t *)logical + VIPNN_MEMORY_ALIGN_SIZE);

error:
	return NULL;
}

void vipnn_free_videomemory(void *ptr)
{
	extern vip_status_e gcvip_user_free_videomemory(void *handle);
	uint8_t *logical = (uint8_t *)ptr - VIPNN_MEMORY_ALIGN_SIZE;
	void *handle = (void *)(*(uint32_t *)logical);
	vip_status_e status = VIP_SUCCESS;
	status = gcvip_user_free_videomemory(handle);
	if (status != VIP_SUCCESS) {
		dprintf(LOG_ERR, "error: gcvip_user_free_videomemory fail.\r\n");
	}
}

int vipnn_load_model(nnmodel_t *model, int *size)
{
	void *fd = nn_f_open(model->nb(), M_NORMAL);
	CHK_MSG(fd != NULL, error, "error: nn_f_open fail.\r\n");
	nn_f_seek(fd, 0, SEEK_END);
	*size = nn_f_tell(fd);
	CHK_MSG(*size > 0, error, "error: wrong model size.\r\n");
	nn_f_seek(fd, 0, SEEK_SET);
	model->model_content = vipnn_allocate_videomemory(*size);
	CHK_MSG(model->model_content != NULL, error, "error: vipnn_allocate_videomemory fail.\r\n");
	CHK_MSG(nn_f_read(fd, model->model_content, *size) >= 0, error, "error: nn_f_read fail to read model.\r\n");
	nn_f_close(fd);
	dcache_clean_invalidate_by_addr((uint32_t *)model->model_content, *size);
	return 0;

error:
	return -1;
}

int vipnn_deoply_network(void *p)
{
	vipnn_ctx_t *ctx = (vipnn_ctx_t *)p;
	vip_status_e status = VIP_SUCCESS;

	if (ctx->params.model->model_src == MODEL_SRC_MEM) {
		void *nn_model = ctx->params.model->nb();
		status = vip_create_network(nn_model, ctx->params.model->nb_size(), VIP_CREATE_NETWORK_FROM_MEMORY, &ctx->network);
		ctx->params.model->freemodel(nn_model);
	} else if (ctx->params.model->model_src == MODEL_SRC_FILE) {
		int nb_size = 0;
		CHK_MSG(vipnn_load_model(ctx->params.model, &nb_size) == 0, vipnn_deploy_error, "error: load model fail\r\n");
		status = vip_create_network(ctx->params.model->model_content, nb_size, VIP_CREATE_NETWORK_FROM_FLASH, &ctx->network);
	} else {
		CHK_MSG(false, vipnn_deploy_error, "error: unsupported model source type\r\n");
	}
	ONERROR(status, "error: vip_create_network.", vipnn_deploy_error);

	dprintf(LOG_INF, "network %p\n\r", ctx->network);

	status = vip_query_network(ctx->network, VIP_NETWORK_PROP_NETWORK_NAME, ctx->network_name);
	ONERROR(status, "error: vip_query_network VIP_NETWORK_PROP_NETWORK_NAME.", vipnn_deploy_error);
	dprintf(LOG_INF, "network name:%s\n\r", ctx->network_name);

	if (init_io_buffers(ctx) < 0) {
		dprintf(LOG_ERR, "error: init_io_buffers.\n\r");
		goto vipnn_deploy_error;
	}

	status = vip_prepare_network(ctx->network);
	ONERROR(status, "error: vip_prepare_network.", vipnn_deploy_error);

	// output buffer can be set here because it may not be changed every inference
	// input buffer should be set before each inference because RGB/NV12 data address may be changed for each inference
	for (int i = 0; i < ctx->output_count; i++) {
		status = vip_set_output(ctx->network, i, ctx->output_buffers[i]);
		ONERROR(status, "error: vip_set_output.", vipnn_deploy_error);
	}

