newbie-jiang/amb82-mini-RTL8735B/sdk-ameba-v9.6c/sdk-ameba-v9.6c/component/media/mmfv2/module_vipnn.c
	// fill model info
	ctx->params.model->input_param.count = ctx->input_count;
	for (int i = 0; i < ctx->input_count; i++) {
		ctx->params.model->input_param.dim[i].num = ctx->vip_param_in[i].num_of_dims;
		memcpy(ctx->params.model->input_param.dim[i].size, ctx->vip_param_in[i].sizes, 6 * sizeof(uint32_t));
		ctx->params.model->input_param.format[i].buf_type = ctx->vip_param_in[i].data_format;
		ctx->params.model->input_param.format[i].type = ctx->vip_param_in[i].quant_format;
		switch (ctx->vip_param_in[i].quant_format) {
		case VIP_BUFFER_QUANTIZE_DYNAMIC_FIXED_POINT:
			ctx->params.model->input_param.format[i].fix_point_pos = ctx->vip_param_in[i].quant_data.dfp.fixed_point_pos;
			break;
		case VIP_BUFFER_QUANTIZE_TF_ASYMM:
			ctx->params.model->input_param.format[i].scale = ctx->vip_param_in[i].quant_data.affine.scale;
			ctx->params.model->input_param.format[i].zero_point = ctx->vip_param_in[i].quant_data.affine.zeroPoint;
			break;
		}
		dprintf(LOG_INF, "in %d, size %d %d\n\r", i, ctx->params.model->input_param.dim[i].size[0], ctx->params.model->input_param.dim[i].size[1]);
	}

	ctx->params.model->output_param.count = ctx->output_count;
	for (int i = 0; i < ctx->output_count; i++) {
		ctx->params.model->output_param.dim[i].num = ctx->vip_param_out[i].num_of_dims;
		memcpy(ctx->params.model->output_param.dim[i].size, ctx->vip_param_out[i].sizes, 6 * sizeof(uint32_t));
		ctx->params.model->output_param.format[i].buf_type = ctx->vip_param_out[i].data_format;
		ctx->params.model->output_param.format[i].type = ctx->vip_param_out[i].quant_format;
		switch (ctx->vip_param_out[i].quant_format) {
		case VIP_BUFFER_QUANTIZE_DYNAMIC_FIXED_POINT:
			ctx->params.model->output_param.format[i].fix_point_pos = ctx->vip_param_out[i].quant_data.dfp.fixed_point_pos;
			break;
		case VIP_BUFFER_QUANTIZE_TF_ASYMM:
			ctx->params.model->output_param.format[i].scale = ctx->vip_param_out[i].quant_data.affine.scale;
			ctx->params.model->output_param.format[i].zero_point = ctx->vip_param_out[i].quant_data.affine.zeroPoint;
			break;
		}
	}

	if (ctx->params.model->set_init_info) {
		ctx->params.model->set_init_info(ctx->params.model);
	}

	for (int i = 0; i < ctx->input_count; i++) {
		ctx->pre_tensor_size[i] = get_element_size(&ctx->params.model->input_param.format[i]);
		for (int k = 0; k < ctx->params.model->input_param.dim[i].num; k++) {
			ctx->pre_tensor_size[i] *= ctx->params.model->input_param.dim[i].size[k];
		}
		ctx->pre_tensor[i] = vipnn_allocate_videomemory(ctx->pre_tensor_size[i]);
		CHK_MSG(ctx->pre_tensor[i] != NULL, vipnn_deploy_error, "error: vipnn_allocate_videomemory fail\r\n");
	}

	return 0;
vipnn_deploy_error:
	vipnn_deinited(ctx);
	return -1;
}

void vipnn_hardware_init(void)
{
	hal_sys_peripheral_en(NN_SYS, ENABLE);
	hal_sys_set_clk(NN_SYS, NN_500M);
	//hal_sys_set_clk(NN_SYS, NN_250M);
	dprintf(LOG_INF, "hal_rtl_sys_get_clk %x \n", hal_sys_get_clk(NN_SYS));
}

void *vipnn_create(void *parent)
{
	vipnn_ctx_t *ctx = (vipnn_ctx_t *)malloc(sizeof(vipnn_ctx_t));
	memset(ctx, 0, sizeof(vipnn_ctx_t));

	ctx->parent = parent;

	vip_status_e status = VIP_SUCCESS;

	if (vipnn_inited == 0) {
		vipnn_hardware_init();

		device_mutex_lock(RT_DEV_LOCK_NN);
		status = vip_init();
		device_mutex_unlock(RT_DEV_LOCK_NN);
		ONERROR(status, "VIP Init failed.", vipnn_error);

		vipnn_inited = 1;
	}

	device_mutex_lock(RT_DEV_LOCK_NN);
	uint32_t nnlib_ver = vip_get_version();
	device_mutex_unlock(RT_DEV_LOCK_NN);
	dprintf(LOG_MSG, "VIPLite Drv version %ld.%ld.%ld\n\r", (nnlib_ver >> 16) & 0xff, (nnlib_ver >> 8) & 0xff, nnlib_ver & 0xff);

	ctx->params.fps = 1;
	ctx->params.out_res_max_cnt = 16;
	ctx->params.out_res_size = 128;

	ctx->status = VIPNN_INITED;
	ctx->tmp_item = NULL;

	vipnn_module_cnt++;

	return ctx;

vipnn_error:

	return NULL;
}

void *vipnn_new_item(void *p)
{
	vipnn_ctx_t *ctx = (vipnn_ctx_t *)p;
	// out buffer structure + result array
	//dprintf(LOG_INF, "new item res size %d cnt %d\n\r", ctx->params.out_res_size, ctx->params.out_res_max_cnt);
	vipnn_out_buf_t *tmp = (vipnn_out_buf_t *)malloc(sizeof(vipnn_out_buf_t) + ctx->params.out_res_size * ctx->params.out_res_max_cnt);
	if (tmp) {
		tmp->res_size = ctx->params.out_res_size;
		tmp->res_max_cnt = ctx->params.out_res_max_cnt;
	}
	return (void *)tmp;
}

void *vipnn_del_item(void *p, void *d)
{
	(void)p;
	if (d) {
		free(d);
	}
	return NULL;
}


mm_module_t vipnn_module = {
	.create = vipnn_create,
	.destroy = vipnn_destroy,
	.control = vipnn_control,
	.handle = vipnn_handle,

	.new_item = vipnn_new_item,
	.del_item = vipnn_del_item,

	.output_type = MM_TYPE_NONE,
	.module_type = MM_TYPE_VDSP,
	.name = "vip nn"
};